Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/********************************** (C) COPYRIGHT *******************************
* File Name          : EHCI_HCD.C
* Author             : MJX
* Version            : V1.20
* Date               : 2013/08/12
* Description        : CH563 USB Host Controller EHCI test pattern file
*******************************************************************************/



/******************************************************************************/
/* 头文件包含 */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "CH563BAS.H" 															/* CH563基本定义相关头文件 */
#include "CH563SFR.H"															/* CH563寄存器定义相关头文件 */	
#include "CH563USBSFR.H"								  						/* 芯片USB寄存器相关头文件 */	
#include "CH563USB.H"								  							/* USB常用定义相关头文件 */	
#include "EHCI_HCD.H"															/* 主机控制器低层操作相关头文件 */
#include "PRINTF.H"																/* 串口打印输出控制头文件 */								
#include "android.h"
/******************************************************************************/
/* 常、变量定义 */
/* USB主机控制传输SETUP包结构体指针定义 */
UINT8  gDeviceClassType;														/* 当前设备类型 */
UINT8V gEHCILastStatus;															/* EHCI最后一次操作状态 */

/* EHCI寄存器相关结构体指针定义 */
EHCI_CAPABILITY *EHCI_Caps;
EHCI_REGISTERS	*EHCI_Regs;
USB_SETUP_REQ   *Ctl_Setup;														/* 控制传输数据包 */

/* 变量及缓冲区定义 */
UINT32 gEHCIFreeRamAddr;														/* EHCI内存分配空闲起始地址 */
UINT32 gEHCI_RAM_BaseAddr;  													/* EHCI数据结构基地址 */
UINT32 gEHCI_QHD_BaseAddr;  													/* EHCI数据结构QHD基地址 */
UINT32 gEHCI_QTD_BaseAddr;  													/* EHCI数据结构QTD基地址 */
UINT32 gEHCI_ITD_BaseAddr;  													/* EHCI数据结构ITD基地址 */
UINT32 gEHCI_Preiodic_Frame_List_BaseAddr;  									/* EHCI周期列表数据结构基地址 */
UINT32 gEHCI_DataPage_BaseAddr;  												/* EHCI数据缓冲区基地址 */
UINT8  EHCI_qHD_Manage[ EHCI_QHD_MAX ];        									/* 1=>Free; 2=>used */
UINT8  EHCI_qTD_Manage[ EHCI_QTD_MAX ];        									/* 1=>Free; 2=>used */
UINT8  EHCI_iTD_Manage[ EHCI_ITD_MAX ];        									/* 1=>Free; 2=>used */  
UINT8  EHCI_DataPage_Manage[ EHCI_DATAPAGE_MAX ];  								/* 1=>Free; 2=>used */ 

/*******************************************************************************
* Function Name  : USBHOST_ModeSet
* Description    : 设置USB主机模式
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USBHOST_ModeSet( void )
{ 
	/* 配置芯片为主机模式 */
	R8_MISC_CTRL_USB =  R8_MISC_CTRL_USB & ( ~RB_MISC_USB_ID_EN );		   		/* USB OTG ID pin enable */									
	R8_MISC_CTRL_USB = R8_MISC_CTRL_USB & ( ~RB_MISC_USB_ID_ST );				/* 设置成USB主机 */	
	OTG_CONTROL_STATUS = 0x000E0190;											/* 配置USB为主机模式 */	
}

/*******************************************************************************
* Function Name  : USBHOST_HC_StopRun_Setting
* Description    : USB主机控制器停止、启动设置
* Input          : option---USBHOST_OP_DISABLE: 停止USB主机控制器
*                           USBHOST_OP_ENABLE:  启动USB主机控制器
* Output         : None
* Return         : 返回当前执行状态
*******************************************************************************/
UINT8 USBHOST_HC_StopRun_Setting( UINT8 option )
{
	UINT16 timeout;

	if( option == USBHOST_OP_ENABLE ) 
	{
		/* 判断是否已启用,若已启用则直接返回 */
		if( ( EHCI_Regs->hc_usbcmd & RB_RS ) && ( EHCI_Regs->hc_usbsts & RB_HCHALTED ) == 0 ) 
		{
			return( USB_OPERATE_SUCCESS );																
		}

		/* 启动USB主机控制器,并等待启动成功 */		
		EHCI_Regs->hc_usbcmd |= RB_RS;
		Delay_ms( 1 );
		for( timeout = 1000; timeout != 0; timeout -- ) 
		{
			Delay_us( 10 );		
			if( ( EHCI_Regs->hc_usbcmd & RB_RS ) && ( EHCI_Regs->hc_usbsts & RB_HCHALTED ) == 0 ) 
			{
				break;
			}
		}
		if ( timeout == 0 ) 
		{
			return( USB_OPERATE_ERROR );										/* 超时退出 */
		}
		return( USB_OPERATE_SUCCESS );		
	}
	else if( option == USBHOST_OP_DISABLE )
	{	
		/* 判断是否已停止,若已停止则直接返回 */
		if( ( EHCI_Regs->hc_usbcmd & RB_RS ) == 0 && ( EHCI_Regs->hc_usbsts & RB_HCHALTED ) ) 
		{	
			return( USB_OPERATE_SUCCESS );																
		}
		
		/* 停止Asynchronous和Periodic传输 */
     	USBHOST_Asynchronous_Setting( USBHOST_OP_DISABLE );
     	USBHOST_Periodic_Setting( USBHOST_OP_DISABLE );
	
		/* 停止USB主机控制器,并等待停止成功 */		
		EHCI_Regs->hc_usbcmd &= ~RB_RS;
		Delay_ms( 1 );
		for( timeout = 1000; timeout != 0; timeout -- ) 
		{
			Delay_us( 10 );		
			if( ( EHCI_Regs->hc_usbcmd & RB_RS ) == 0 && ( EHCI_Regs->hc_usbsts & RB_HCHALTED ) ) 
			{	
				break;
			}
		}
		if( timeout == 0 ) 
		{	
			return( USB_OPERATE_ERROR );										/* 超时退出 */
		}
     	return( USB_OPERATE_SUCCESS );		
	}
	return( USB_PARAMETER_ERROR );
}	
	
/*******************************************************************************
* Function Name  : USBHOST_Asynchronous_Setting
* Description    : USB主机启用、停止Asynchronous传输
* Input          : option---USBHOST_OP_DISABLE: USB主机停止Asynchronous传输
*                           USBHOST_OP_ENABLE:  USB主机启用Asynchronous传输
* Output         : None
* Return         : 返回当前执行状态
*******************************************************************************/
UINT8 USBHOST_Asynchronous_Setting( UINT8 option )
{			
	UINT16 timeout;

	if( option == USBHOST_OP_ENABLE ) 
	{	
		/* 判断是否已启用,若已启用则直接返回 */
		if( EHCI_Regs->hc_usbsts & RB_ASCH_STS ) 
		{
			return( USB_OPERATE_SUCCESS );	
		}
								
		/* 启动Asynchronous传输,并等待启动成功 */	
		EHCI_Regs->hc_usbcmd |= RB_ASCH_EN;
		Delay_ms( 1 );	
		for( timeout = 1000; timeout != 0; timeout -- ) 
		{
			Delay_us( 10 );		
			if( EHCI_Regs->hc_usbsts & RB_ASCH_STS ) 
			{
				break;
			}
		}
		if( timeout == 0 ) 
		{
			return( USB_OPERATE_ERROR );										/* 超时退出 */
		}
		return( USB_OPERATE_SUCCESS );
	}
	else if( option == USBHOST_OP_DISABLE ) 
	{
		/* 判断是否已停止,若已停止则直接返回 */
		if( ( EHCI_Regs->hc_usbcmd & RB_ASCH_EN ) == 0x00 && ( EHCI_Regs->hc_usbsts & RB_ASCH_STS ) == 0x00 ) 
		{
			return( USB_OPERATE_SUCCESS );	
		}
		
		/* 停止Asynchronous传输,并等待停止结束 */				
		EHCI_Regs->hc_usbcmd &= ~RB_ASCH_EN;
		Delay_ms( 1 );	
		for( timeout = 1000; timeout != 0; timeout -- ) 
		{
			Delay_us( 10 );		
			if( ( EHCI_Regs->hc_usbsts & RB_ASCH_STS ) == 0 ) 
			{
				break;
			}	
		}
		if( timeout == 0 ) 
		{
			return( USB_OPERATE_ERROR );										/* 超时退出 */
     	}
     	return( USB_OPERATE_SUCCESS );
	}                
	return( USB_PARAMETER_ERROR );
}

