Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/*******************************************************************************
* Function Name  : USBHOST_Periodic_Setting
* Description    : USB主机启用、停止Periodic传输
* Input          : option---USBHOST_OP_DISABLE: USB主机停止Periodic传输
*                           USBHOST_OP_ENABLE:  USB主机启用Periodic传输
* Output         : None
* Return         : 返回当前执行状态
*******************************************************************************/
UINT8 USBHOST_Periodic_Setting( UINT8 option )
{
	UINT16 timeout;

	if( option == USBHOST_OP_ENABLE ) 
	{	
		/* 判断是否已启用,若已启用则直接返回 */
		if( EHCI_Regs->hc_usbsts & RB_PSCH_STS ) 
		{
			return( USB_OPERATE_SUCCESS );	
		}
				
		/* 启动Periodic传输,并等待启动成功 */	
		EHCI_Regs->hc_usbcmd |= RB_PSCH_EN;	
		Delay_ms( 1 );									
		for( timeout = 1000; timeout != 0; timeout -- ) 
		{
			Delay_us( 10 );		
			if( EHCI_Regs->hc_usbsts & RB_PSCH_STS ) 
			{
				break;
			}
		}
		if( timeout == 0 ) 
		{
			return( USB_OPERATE_ERROR );										/* 超时退出 */
		}
     	return( USB_OPERATE_SUCCESS );
	}
	else if( option == USBHOST_OP_DISABLE ) 
	{
		/* 判断是否已停止,若已停止则直接返回 */
		if( ( EHCI_Regs->hc_usbcmd & RB_PSCH_EN ) == 0x00 && ( EHCI_Regs->hc_usbsts & RB_PSCH_STS ) == 0x00 ) 
		{
			return( USB_OPERATE_SUCCESS );	
		}
				
		/* 停止Periodic传输,并等待停止结束 */				
		EHCI_Regs->hc_usbcmd &= ~RB_PSCH_EN;
		Delay_ms( 1 );	
		for( timeout = 1000; timeout != 0; timeout -- ) 
		{
			Delay_us( 10 );		
			if( ( EHCI_Regs->hc_usbsts & RB_PSCH_STS ) == 0 ) 
			{
				break;
			}
		}
		if( timeout == 0 ) 
		{
			return( USB_OPERATE_ERROR );										/* 超时退出 */
		}
     	return( USB_OPERATE_SUCCESS );
	}                
	return( USB_PARAMETER_ERROR );
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_Init
* Description    : USB主机EHCI初始化
* Input          : None
* Output         : None
* Return         : USB_OPERATE_SUCCESS---EHCI主机初始化成功
*                  USB_HC_ERROR----------EHCI主机初始化失败
*******************************************************************************/
UINT8 USBHOST_EHCI_Init( void )
{
	UINT8  status;
	UINT16 count;
	
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_EHCI_Init:...\n " );
#endif
	/* Set EHCI Memory Register */
	EHCI_Caps = ( EHCI_CAPABILITY *)( USB_BASE_ADDR + 0x000 );
	EHCI_Regs = ( EHCI_REGISTERS *)( USB_BASE_ADDR + 0x010 );	  

	USBHOST_HC_StopRun_Setting( USBHOST_OP_DISABLE );							/* 关闭USB主机控制器 */
	Delay_ms( 3 );

	/* Reset EHCI Host Control */
	EHCI_Regs->hc_usbcmd |= RB_HC_RESET;										/* 开始HC复位 */
	for( count = 1000; count != 0; count -- ) 
	{
		Delay_us( 10 );
		if( ( EHCI_Regs->hc_usbcmd & RB_HC_RESET ) == 0 ) 
		{
			break;																/* 等待HC复位完成,硬件自动清0 */
		}
	}
	if( count == 0 ) 
	{
		return( USB_HC_ERROR );													/* 超时未复位完成,则报告错误 */	
	}	
	Delay_ms( 3 );	

	/* 检查部分寄存器默认值是否正确 */
	if( RB_HC_LENGTH( EHCI_Caps->hc_caplength ) != 0x0010 )
	{
		return( USB_HC_ERROR );
	}	
	if( RB_HC_VERSION( EHCI_Caps->hc_caplength ) != 0x0100 )
	{
		return( USB_HC_ERROR );
	}	
	if( EHCI_Caps->hc_hcsparams != 0x0001 )
	{
		return( USB_HC_ERROR );
	}	
	if( EHCI_Caps->hc_hccparams != 0x0006 )
	{
		return( USB_HC_ERROR );
	}	

	/* 初始化EHCI部分寄存器 */
//	EHCI_Regs->hc_frindex = 0x00000000;									    	/* 清USB数据索引寄存器 */
	EHCI_Regs->hc_periodiclistbase = 0x00000000;								/* 周期性数据帧列表基址清0 */
	EHCI_Regs->hc_asynchronous = 0x00000000;									/* 异步列表地址清0 */ 									
	EHCI_Regs->hc_portsc = EHCI_PORT_INIT; 				    					/* 清端口状态、控制寄存器 */	
	EHCI_Regs->hc_usbint_en = RB_INT_OAA_EN | RB_H_SYSERR_EN | RB_PO_CHG_INT_EN |
							  RB_USBERR_INT_EN | RB_USB_INT_EN; 				/* 设置USB中断启用寄存器 */
	EHCI_Regs->hc_usbcmd = 0x00080100 | 0x08; 											/* 清USB命令寄存器 */		
	EHCI_Regs->hc_usbsts = EHCI_Regs->hc_usbsts;								/* 清USB状态寄存器 */ 
	status = USBHOST_Structure_DeInit( );										/* 初始化USB HOST为所有结构体分配的内存 */
	if( status )
	{
		return( status );
	}	
	EHCI_Regs->hc_asynchronous = gEHCI_QHD_BaseAddr;							/* 设置异步列表地址 */ 
	EHCI_Regs->hc_periodiclistbase = gEHCI_Preiodic_Frame_List_BaseAddr;		/* 设置周期性数据帧列表基址 */
	Delay_ms( 1 );																/* 延时 */
	return( USB_OPERATE_SUCCESS );
}

/*******************************************************************************
* Function Name  : USBHOST_Structure_DeInit
* Description    : USB主机控制器所有数据结构所在内存分配及初始化
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Structure_DeInit( void )
{
	UINT8  i;
	UINT8  *pData;
	UINT32 address;
	char   *host_memory_ptr;

	/* 确保传输全部关闭 */
	USBHOST_Periodic_Setting( USBHOST_OP_DISABLE );
	USBHOST_Asynchronous_Setting( USBHOST_OP_DISABLE );
	Delay_ms( 3 );

	/* 1、进行EHCI相关内存分配 */
	gEHCIFreeRamAddr = (UINT32)EHCI_Allocate_Buf;								
	host_memory_ptr = (char *)( ( gEHCIFreeRamAddr + 0x1F ) & ~0x1F );
	gEHCI_RAM_BaseAddr = (UINT32)host_memory_ptr;								/* EHCI数据结构基地址 */
	gEHCIFreeRamAddr = (UINT32)host_memory_ptr;									/* EHCI内存分配空闲起始地址 */
					
	/* 1.1、分配QHD所需内存空间 */
	address = (UINT32)host_memory_ptr;
	if( ( address + ( EHCI_QHD_SIZE * EHCI_QHD_MAX ) ) > ( (UINT32)EHCI_Allocate_Buf + EHCI_ALLOCATE_BUF_LEN ) )
	{
		return( USB_MEM_ALLOCATE_ERROR );										/* 内存分配失败 */	
	}											
	gEHCI_QHD_BaseAddr = address;												/* EHCI数据结构QHD基地址 */		
	gEHCIFreeRamAddr = address + ( EHCI_QHD_SIZE * EHCI_QHD_MAX );				/* 更新可用起始地址 */	

	/* 1.2、分配QTD所需内存空间 */
	address = gEHCIFreeRamAddr + ( EHCI_QTD_SIZE * EHCI_QTD_MAX );
	if( address > ( (UINT32)EHCI_Allocate_Buf + EHCI_ALLOCATE_BUF_LEN ) )
	{
		return( USB_MEM_ALLOCATE_ERROR );										/* 内存分配失败 */	
	}											
	gEHCI_QTD_BaseAddr = gEHCIFreeRamAddr;  									/* EHCI数据结构QTD基地址 */
	gEHCIFreeRamAddr = address;													/* 更新可用起始地址 */	

	/* 1.3、分配ITD所需内存空间 */
	address = gEHCIFreeRamAddr + ( EHCI_ITD_SIZE * EHCI_ITD_MAX );
	if( address > ( (UINT32)EHCI_Allocate_Buf + EHCI_ALLOCATE_BUF_LEN ) )
	{
		return( USB_MEM_ALLOCATE_ERROR );										/* 内存分配失败 */	
	}											
	gEHCI_ITD_BaseAddr = gEHCIFreeRamAddr;  									/* EHCI数据结构ITD基地址 */
	gEHCIFreeRamAddr = address;													/* 更新可用起始地址 */	

