Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
	/* 1.4、分配周期帧列表所需内存空间 */										
	gEHCI_Preiodic_Frame_List_BaseAddr = (UINT32)EHCI_PERIODIC_LIST_Buf;  		/* EHCI周期列表数据结构基地址 */

	/* 2、初始化已分配的EHCI相关内存 */
	pData = EHCI_Allocate_Buf;
	while( (UINT32)pData < gEHCIFreeRamAddr )
	{
		*pData = 0;
		pData++;
	}
	
	/* 3、清QHD、QTD、ITD、DataPage内存管理单元 */	
	for( i = 0; i < EHCI_QHD_MAX; i++ )
	{
		EHCI_qHD_Manage[ i ] = EHCI_MEM_FREE;
	}
	for( i = 0; i < EHCI_QTD_MAX; i++ )
	{
		EHCI_qTD_Manage[ i ] = EHCI_MEM_FREE;
	}	
	for( i = 0; i < EHCI_ITD_MAX; i++ )
	{
		EHCI_iTD_Manage[ i ] = EHCI_MEM_FREE;
	}	
	for( i = 0; i < EHCI_DATAPAGE_MAX; i++ )
	{
		EHCI_DataPage_Manage[ i ] = EHCI_MEM_FREE;
	} 
	
	/* 4、指定EHCI数据缓冲区地址 */
	gEHCI_DataPage_BaseAddr = (UINT32)EHCI_Data_Buf;  							/* EHCI数据缓冲区基地址 */

	/* 5、分配Setup包所需内存 */
	Ctl_Setup = (USB_SETUP_REQ *)gEHCIFreeRamAddr;
	gEHCIFreeRamAddr = gEHCIFreeRamAddr + 8;						
	return( USB_OPERATE_SUCCESS );	   	
}

/*******************************************************************************
* Function Name  : USBHOST_GetStructure
* Description    : 分配数据结构所需内存
* Input          : Type---要分配的数据结构类型
* Output         : None
* Return         : 返回USB_MEM_ALLOCATE_ERROR表示失败; 
*                  返回非USB_MEM_ALLOCATE_ERROR表示成功分配的实际内存地址
*******************************************************************************/
UINT32 USBHOST_GetStructure( UINT8 Type )
{
	UINT32 i;
	qHD_Structure *spTempqHD;	
	qTD_Structure *spTempqTD;
	iTD_Structure *spTempiTD;

	switch( Type ) 
	{
		case EHCI_MEM_TYPE_QHD:													/* 数据结构: QHD */
			for( i = 0; i < EHCI_QHD_MAX; i++ )
			{
				/* 寻找未用内存 */
				if( EHCI_qHD_Manage[ i ] == EHCI_MEM_FREE ) 
				{
					EHCI_qHD_Manage[ i ] = EHCI_MEM_USED;						/* 设置已分配标志 */
					
					/* 对qHD数据结构部分进行初始化 */					
					spTempqHD = ( qHD_Structure * )( gEHCI_QHD_BaseAddr + ( i * EHCI_QHD_SIZE ) );
					return( (UINT32)spTempqHD );
				}
			}	             
			break;		
		
		case EHCI_MEM_TYPE_QTD:  												/* 数据结构: QTD */
			for( i = 0; i < EHCI_QTD_MAX; i++ )
			{
				/* 寻找未用内存 */
				if( EHCI_qTD_Manage[ i ] == EHCI_MEM_FREE ) 
				{
					EHCI_qTD_Manage[ i ] = EHCI_MEM_USED;						/* 设置已分配标志 */

					/* 对qTD数据结构部分进行初始化 */					
					spTempqTD = ( qTD_Structure * )( gEHCI_QTD_BaseAddr + ( i * EHCI_QTD_SIZE ) );				
					spTempqTD->bTerminate = 0x01;       
					spTempqTD->bStatus_Active = 0x00;            
					spTempqTD->bInterruptOnComplete = 0x01;   
					spTempqTD->bAlternateTerminate = 0x01;    
					spTempqTD->bErrorCounter = 0x03;                        
					return( (UINT32)spTempqTD );
				}
			}	             
			break;

		case EHCI_MEM_TYPE_ITD: 												/* 数据结构: ITD */ 
			for( i = 0; i < EHCI_ITD_MAX; i++ )
			{
				/* 寻找未用内存 */
				if( EHCI_iTD_Manage[ i ] == EHCI_MEM_FREE ) 				
				{
					EHCI_iTD_Manage[ i ] = EHCI_MEM_USED;						/* 设置已分配标志 */

					/* 对iTD数据结构部分进行初始化 */										
					spTempiTD = ( iTD_Structure * )( gEHCI_ITD_BaseAddr + ( i * EHCI_ITD_SIZE ) );
					spTempiTD->bTerminate = 0x01; 
					return( (UINT32)spTempiTD );
				}
			}
			break;

		case EHCI_MEM_TYPE_SITD: 												/* 数据结构: SITD */ 
			/* 不支持SITD */
			break;

		case EHCI_MEM_TYPE_4K_BUFFER: 											/* 数据缓冲区 */ 	
			for( i = 0; i < EHCI_DATAPAGE_MAX; i++ )						
			{
				/* 寻找未用内存 */
				if( EHCI_DataPage_Manage[ i ] == EHCI_MEM_FREE ) 
				{
					EHCI_DataPage_Manage[ i ] = EHCI_MEM_USED;
					return( (UINT32)( gEHCI_DataPage_BaseAddr + i * EHCI_DATAPAGE_SIZE ) );    
				}       		
			}
			break;
       	
		default:
			break;  	
	}
	return( USB_MEM_ALLOCATE_ERROR );											/* 内存分配出错 */
}

/*******************************************************************************
* Function Name  : USBHOST_ReleaseStructure
* Description    : 回收数据结构所分配的内存
* Input          : Type--------要回收的数据结构类型
*                  pwAddress---要回收的数据结构物理地址
* Output         : None
* Return         : 返回USB_OPERATE_ERROR表示回收失败; 
*                  返回USB_OPERATE_SUCCESS表示回收成功
*******************************************************************************/
UINT8 USBHOST_ReleaseStructure( UINT8 Type, UINT32 pwAddress )
{
	UINT32 i;
	UINT32 wReleaseNum;
	UINT32 *pData;

	pData = ( UINT32 *)pwAddress; 
	switch( Type ) 
	{
		case EHCI_MEM_TYPE_QHD:  
			if( ( pwAddress < gEHCI_QHD_BaseAddr ) || ( ( pwAddress > gEHCI_QTD_BaseAddr ) ) ) 
			{
				return( USB_OPERATE_ERROR );
			}
			wReleaseNum = ( pwAddress - gEHCI_QHD_BaseAddr ) / EHCI_QHD_SIZE;                
			if( wReleaseNum > EHCI_QHD_MAX ) 
			{
				return( USB_OPERATE_ERROR );
			}

			/* 回收数据结构所分配的内存 */			    
			EHCI_qHD_Manage[ wReleaseNum ] = EHCI_MEM_FREE; 					/* 清已分配标志 */
			for( i = 0; i < EHCI_QHD_SIZE / 4; i++ )
			{
				*( pData + i ) = 0x00;
			}
			break;		
		
		case EHCI_MEM_TYPE_QTD:  
			if( ( pwAddress < gEHCI_QTD_BaseAddr ) || ( ( pwAddress > gEHCI_ITD_BaseAddr ) ) ) 
			{
				return( USB_OPERATE_ERROR );
			}
			wReleaseNum = ( pwAddress - gEHCI_QTD_BaseAddr ) / EHCI_QTD_SIZE;                
			if( wReleaseNum > EHCI_QTD_MAX ) 
			{
				return( USB_OPERATE_ERROR );
			}

			/* 回收数据结构所分配的内存 */			    
			EHCI_qTD_Manage[ wReleaseNum ] = EHCI_MEM_FREE; 					/* 清已分配标志 */
			for( i = 0; i < EHCI_QTD_SIZE / 4; i++ )
			{
				*( pData + i ) = 0x00;
			}
			break;

		case EHCI_MEM_TYPE_ITD:
			if( ( pwAddress < gEHCI_ITD_BaseAddr ) || ( pwAddress > gEHCI_Preiodic_Frame_List_BaseAddr ) ) 
			{
				return( USB_OPERATE_ERROR );
			}
			wReleaseNum = ( pwAddress - gEHCI_ITD_BaseAddr ) / EHCI_ITD_SIZE;                
			if( wReleaseNum > EHCI_ITD_MAX ) 
			{
				return( USB_OPERATE_ERROR );
			}
			
			/* 回收数据结构所分配的内存 */	 
			EHCI_iTD_Manage[ wReleaseNum ] = EHCI_MEM_FREE;						/* 清已分配标志 */             
			for( i = 0; i < EHCI_ITD_SIZE / 4; i++ )
			{
				*( pData + i ) = 0x00;        
			}
			break;

		case EHCI_MEM_TYPE_4K_BUFFER:      
			if( ( pwAddress < gEHCI_DataPage_BaseAddr ) || ( pwAddress > gEHCI_DataPage_BaseAddr + EHCI_DATA_BUF_LEN ) ) 
			{
				return( USB_OPERATE_ERROR );
			}
			wReleaseNum = ( pwAddress - gEHCI_DataPage_BaseAddr ) / EHCI_DATAPAGE_SIZE;
			if( wReleaseNum > EHCI_DATAPAGE_MAX) 
			{
				return( USB_OPERATE_ERROR );
			}  
			
			/* 回收数据缓冲区所分配的内存 */			            
			EHCI_DataPage_Manage[ wReleaseNum ] = EHCI_MEM_FREE;  				/* 清已分配标志 */ 	
			break;	

		default: 
			return( USB_OPERATE_ERROR );
	}
	return( USB_OPERATE_SUCCESS );
}

