Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/*******************************************************************************
* Function Name  : USBHOST_Allocate_QH
* Description    : 初始化分配的QH
* Input          : *Device---------当前操作的设备
                   *psQHTemp-------需要进行初始化的QH
*                  bQHType---------当前QH类型
*                  bType-----------当前端点是否为控制传输端点
*                  bHead-----------当前QH是否为队列头
*                  bEndPt----------当前端点号
*                  wMaxPacketSize--当前端点最大包大小
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Allocate_QHD( ATTACH_DEVICE_INFO *Device, 
                            qHD_Structure *psQHTemp, 
							UINT8 bQHType, 
							UINT8 bType, 
							UINT8 bHead, 
							UINT8 bEndPt, 
							UINT32 wMaxPacketSize )
{
	qTD_Structure *spTempqTD;

	/* 根据提供的参数,初始化分配的qHD */
	/* <1>.Next_qHD_Pointer Word */
	psQHTemp->bTerminate = 0x00;                  
	psQHTemp->bType = bQHType;                         
                
	/* <2>.qHD_2 Word */
	psQHTemp->bDeviceAddress = Device->bAddress;             					/* Bit6---0 */ 	
	psQHTemp->bInactiveOnNextTransaction = 0x00; 								/* Bit7 */
	psQHTemp->bEdNumber = bEndPt;                  								/* Bit11---8 */   			
	psQHTemp->bEdSpeed = Device->bSpeed;                   						/* Bit13---12 */ 
	if( bType )
	{	
	    psQHTemp->bDataToggleControl = 0x01;         							/* Bit14: 1 for control 0 for Bulk */   
	}
	else
	{
	    psQHTemp->bDataToggleControl = 0x00;         							/* Bit14: 1 for control 0 for Bulk */   
	}	
	psQHTemp->bHeadOfReclamationListFlag = bHead;   							/* Bit15 */
	psQHTemp->bMaxPacketSize = wMaxPacketSize;      							/* Bit26---16 */ 	
	if( ( Device->bSpeed != EHCI_DEVICE_SPEED_HS ) && ( bType ) )
	{	
		psQHTemp->bControlEdFlag = 0x01;             							/* Bit27 */ 
	}
	psQHTemp->bNakCounter = 0x00; 		           								/* Bit31---28 */ 

	/* <3>.qHD_3 Word */    
	psQHTemp->bInterruptScheduleMask = 0x00;     								/* Bit7---0 */
	psQHTemp->bSplitTransactionMask = 0x00;      								/* Bit15---8 */
	psQHTemp->bHubAddr = Device->bHubAddress;                   				/* Bit22---16 */  
	psQHTemp->bPortNumber = Device->bOnHubPortNumber;                			/* Bit29---23 */  
	psQHTemp->bHighBandwidth = 0x01;             								/* Bit31---30 */  

	/* <4>.Overlay_CurrentqTD */  

	/* <5>.Overlay_NextqTD */       
	psQHTemp->bOverlay_NextTerminate = 0x01;									/* Bit0 */

	/* <6>.Overlay_AlternateNextqTD */       
	psQHTemp->bOverlay_AlternateNextTerminate = 0x01;							/* Bit0 */

	/* <7>.Overlay_TotalBytes */       
	psQHTemp->bOverlay_Status = 0;

	/* <8>.Overlay_BufferPointer0 */ 
   
	/* 分配1个qTD,并挂载到QH上 */
	spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD ); 
	psQHTemp->bOverlay_NextqTD = ( ( (UINT32)spTempqTD ) >> 0x05 );
	psQHTemp->bOverlay_AlternateqTD = ( ( (UINT32)spTempqTD ) >> 0x05 );

	/* <4>.Overlay_CurrentqTD */  
	psQHTemp->bOverlay_CurrentqTD = (UINT32)spTempqTD;  						/* 不必要,用于记忆当前操作副本的原始TD */
	psQHTemp->bOverlay_NextTerminate = 0x00;
	psQHTemp->bOverlay_AlternateNextTerminate = 0x00;
	
	return( USB_OPERATE_SUCCESS );	
}

/*******************************************************************************
* Function Name  : USBHOST_Resume
* Description    : 
* Input          : *Device----------当前操作的设备
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Resume( ATTACH_DEVICE_INFO *Device )
{
//	if( ( EHCI_Regs->hc_portsc & RB_PO_SUSP ) == 0 )  return( USB_PARAMETER_ERROR );

	EHCI_Regs->hc_portsc |= RB_F_PO_RESM;	
	Delay_ms( 30 );      
	
	/* Write PORTSC->ForcePortResume = 0 (Host should not issue the PortChange interrupt) */
	EHCI_Regs->hc_portsc &= ~RB_F_PO_RESM;	
	Delay_us( 100 );

	if( EHCI_Regs->hc_portsc & RB_PO_SUSP )  
	{
		return( USB_PARAMETER_ERROR );
	}
	Device->bSuspend = 0x00;													/* 清设备挂起标志 */
	return ( USB_OPERATE_SUCCESS );  
}

/*******************************************************************************
* Function Name  : USBHOST_Suspend
* Description    : 
* Input          : *Device----------当前操作的设备
* Output         : None
* Return         : 返回0x00表示成功; 返回0x01表示失败
*******************************************************************************/
UINT8 USBHOST_Suspend( ATTACH_DEVICE_INFO *Device )
{
	if( ( EHCI_Regs->hc_portsc & RB_PO_EN ) == 0 )    
	{
		return( USB_PARAMETER_ERROR );
	}
	   
	/* Write PORTSC->Suspend=1 */    
	EHCI_Regs->hc_portsc |= RB_PO_SUSP; 
	Device->bSuspend = 1;
	Delay_us( 100 );
	if ( ( EHCI_Regs->hc_portsc & RB_PO_SUSP ) == 0x00 ) EHCI_Regs->hc_portsc |= RB_PO_SUSP;

	/* Waiting for the PORTSC->Suspend=1 */
//	while( EHCI_Regs->hc_portsc & RB_PO_SUSP == 0x00 );

	return( USB_OPERATE_SUCCESS );
}

/*******************************************************************************
* Function Name  : DEBUG_Printf_Memary
* Description    : 打印指定内存空间数据
* Input          : startaddr---内存空间起始地址
*                  size--------打印双字节数据数
* Output         : None
* Return         : None
*******************************************************************************/
void DEBUG_Print_Memory( UINT32 startaddr, UINT16 size )
{
	UINT32 *p;
	UINT16 i;
	
	p = (UINT32 *)startaddr;	
	printf( "Memory Start Address: %08lx\n",startaddr);
	for( i = 0; i < size; i++ )
	{
		printf( "%08lx\n",*p++ );
	}		
}

/*******************************************************************************
* Function Name  : USBHOST_DevicePara_Init
* Description    : 初始化设备相关参数
* Input          : *Device---当前操作的设备
* Output         : None
* Return         : None
*******************************************************************************/
void USBHOST_DevicePara_Init( ATTACH_DEVICE_INFO *Device )
{																
	gEHCILastStatus = 0x00;	 													/* 清EHCI最后一次操作状态 */

	Device->bDeviceOnHub = 0x00;												/* 默认当前USB设备未连接在HUB下 */
	Device->bOnHubPortNumber = 0x00;											/* 默认当前USB设备在HUB上的端口号为0 */
	Device->bAddress = 0x00;													/* 默认当前USB设备地址为0 */
	Device->bHubAddress = 0x00;													/* 默认当前USB挂载的HUB地址为0 */	
	Device->bConnectStatus = 0x00;												/* 默认当前USB设备未连接 */
	Device->bPortEnableDisableStatus = 0x00;									/* 默认端口未使能 */	
	Device->bSpeed = 0xFF;														/* 默认当前USB设备速度未知 */	
	Device->bEp0MaxPks = DEFAULT_USB_EP0_SIZE;									/* 默认当前USB设备端点0最大包大小为8 */	
	Device->bPortReset = 0x00;													/* 默认当前USB设备未复位 */
	Device->bSuspend = 0x00;													/* 默认当前USB设备未挂起 */
	Device->bRemoteWakeUpDetected = 0x00;									
	Device->bSendOK = 0x00;														/* 默认当前USB设备发送成功 */
	Device->bSendStatusError = 0x00;											/* 默认当前USB设备发送状态为0 */		
}

