Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/*******************************************************************************
* Function Name  : USBHOST_EHCI_BusReset
* Description    : USB主机进行总线复位
* Input          : *Device---当前操作的设备
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_EHCI_BusReset( ATTACH_DEVICE_INFO *Device )  
{
	UINT32 timeout;

#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_BusReset:...\n " );
#endif	

	if( Device->bDeviceOnHub )													/* 当前设备连接在HUB下 */	
	{
		return( USB_OPERATE_SUCCESS );
	}

	/* 设置设备地址及端点0最大包大小 */
	Device->bEp0MaxPks = DEFAULT_USB_EP0_SIZE;									/* 默认当前USB设备端点0最大包大小为64 */	
	Device->bAddress = 0x00;													/* 保存当前操作的地址值 */
	
	/* 进行USB总线复位 */
	EHCI_Regs->hc_portsc = EHCI_PORT_INIT | RB_PO_RESET;						/* 设置PORTSC位8进行USB总线复位 */
	Delay_ms( 60 );		
	EHCI_Regs->hc_portsc = EHCI_PORT_INIT;										/* 清PORTSC位8结束USB总线复位 */
	Delay_ms( 2 );		
		
	/* 等待复位结束 */	
	for( timeout = 200000; timeout != 0; timeout -- ) 
	{
		Delay_us( 10 );				
		if( ( EHCI_Regs->hc_portsc & RB_PO_RESET ) == 0 ) 
		{
			break;																/* 等待复位结束 */
		}
	}
	if( timeout == 0 ) 
	{
		return( USB_OPERATE_ERROR );											/* 超时未复位完成,则报告错误 */	
	}
	Delay_ms( 5 );  															/* EHCI必须等一会才能工作 */
	EHCI_Regs->hc_usbsts = RB_PO_CHG_DET;
	return( USB_OPERATE_SUCCESS );
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_Detect_Connect
* Description    : USB主机检测设备插拔
*                  注：端口使能位在总线复位时由主机控制器自动置1
* Input          : *Device---当前操作的设备
* Output         : None
* Return         : 0x00-----------------无USB设备
*                  0x01-----------------有USB设备但尚未使能
*                  0x02-----------------有USB设备且已经使能
*                  USB_INT_CONNECT------检测到USB设备连接事件
*                  USB_INT_DISCONNECT---检测到USB设备断开事件
*******************************************************************************/
UINT8 USBHOST_EHCI_Detect_Connect( ATTACH_DEVICE_INFO *Device )
{			
	if( EHCI_Regs->hc_portsc & RB_CONN_CHG )									/* Connect status change */
	{	
		EHCI_Regs->hc_usbsts = RB_PO_CHG_DET;									/* Clear Port change detect */
		EHCI_Regs->hc_portsc = RB_CONN_CHG;					    				/* 清变化位 */
		Delay_ms( 3 );
					
		/* 判断当前改变是连接还是断开 */
		if( EHCI_Regs->hc_portsc & RB_CONN_STS )
		{
			/* start controller operations */				
			USBHOST_HC_StopRun_Setting( USBHOST_OP_ENABLE );					/* 启动USB主机控制器 */				
			Delay_ms( 110 );
			USBHOST_EHCI_BusReset( Device );									/* 进行USB总线复位 */
			Delay_ms( 5 );
			EHCI_Regs->hc_usbsts = RB_PO_CHG_DET;
			Device->bConnectStatus = 0x01;	            

			/* 进行当前USB设备速度判断 */
			Device->bSpeed = ( OTG_CONTROL_STATUS >> 22 ) & 0x03;				/* 取OTG Control Status Register(0x080)的位23-22 */		
			return( USB_INT_CONNECT );											/* 检测到USB设备连接事件 */ 				
		}	
		else
		{
			USBHOST_DevicePara_Init( Device );									/* 清相关参数 */	
			return( USB_INT_DISCONNECT );										/* 检测到USB设备断开事件 */
		}			
	}	
	else
	{			
		if( ( EHCI_Regs->hc_portsc & RB_CONN_STS ) == 0x00 )
		{
			return( USB_INT_DISCONNECT );										/* 无USB设备 */
		}		
		else
		{
			if( EHCI_Regs->hc_portsc & RB_PO_EN )
			{
				return( 0x02 );													/* 有USB设备且已经使能 */	
			}	
			else
			{
				/* start controller operations */				
				USBHOST_HC_StopRun_Setting( USBHOST_OP_ENABLE );				/* 启动USB主机控制器 */				
				Delay_ms( 110 );
				USBHOST_EHCI_BusReset( Device );								/* 进行USB总线复位 */
				Delay_ms( 5 );
				EHCI_Regs->hc_usbsts = RB_PO_CHG_DET;
				Device->bConnectStatus = 0x01;	            
	
				/* 进行当前USB设备速度判断 */
				Device->bSpeed = ( OTG_CONTROL_STATUS >> 22 ) & 0x03;			/* 取OTG Control Status Register(0x080)的位23-22 */		

				return( 0x01 );													/* 有USB设备但尚未使能 */	
			}	
		}					
	}			
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_EP0_Init
* Description    : USB主机控制端点0初始化
* Input          : *Device---当前操作的设备
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_EHCI_EP0_Init( ATTACH_DEVICE_INFO *Device )
{
	UINT32 temp;
	
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_EP0_Init:...\n" );
#endif
	
	/* 分配当前控制传输所需要的QH */
	temp = USBHOST_GetStructure( EHCI_MEM_TYPE_QHD );
	if( temp == USB_MEM_ALLOCATE_ERROR )
	{
		return( USB_MEM_ALLOCATE_ERROR );
	}	
	Device->qHD_Control = ( qHD_Structure *)temp;								/* 分配qHD_Structure */

	/*  初始化分配的QHD */
	USBHOST_Allocate_QHD( Device, 
						  Device->qHD_Control, 
						  EHCI_HD_TYPE_QH, 
						  EHCI_EP_TYPE_CONTROL, 
						  1, 
						  0, 
						  DEFAULT_USB_EP0_SIZE );

	/* 将分配的QHD链接到QHD链表中 */
	USBHOST_qHD_Link_Insert( Device->qHD_Control );	
	
	EHCI_Regs->hc_asynchronous = (UINT32)Device->qHD_Control;
	USBHOST_Asynchronous_Setting( USBHOST_OP_ENABLE );							/* Enable USB asynchronous Schedule */ 
	Delay_ms( 3 );
	return( USB_OPERATE_SUCCESS );	
}

/*******************************************************************************
* Function Name  : USBHOST_Error_Int_Deal
* Description    : USB主机EHCI相关错误中断处理
*                  只关心以下中断: 位0----RB_USB_INT
*                                  位1----RB_USBERR_INT
*                                  位2----RB_PO_CHG_DET
*                                  位4----RB_H_STSERR 
* Input          : None
* Output         : None
* Return         : 返回当前中断状态
*******************************************************************************/
UINT8 USBHOST_Error_Int_Deal( ATTACH_DEVICE_INFO *Device )
{
	UINT32 ints;
		
	ints = EHCI_Regs->hc_usbsts;												/* 读取EHCI中USBSTS寄存器 */
	if( ints & RB_USB_INT ) 													/* USBSTS位0: USB Interrupt */	
	{
		EHCI_Regs->hc_usbsts = RB_USB_INT;										/* 清USB事务完成中断 */
	}
	else if( ints & RB_USBERR_INT ) 											/* USBSTS位1: USB Error Interrupt */
	{	
		EHCI_Regs->hc_usbsts = RB_USBERR_INT;									/* 清USB错误中断 */
	}
	else if( ints & RB_PO_CHG_DET ) 											/* USBSTS位2: Port Change Detect */
	{		
		EHCI_Regs->hc_usbsts = RB_PO_CHG_DET;
		return( USB_INT_DISCONNECT );
	}	
	else if( ints & RB_H_STSERR ) 												/* USBSTS位4: HOST系统错误中断 */
	{	
		EHCI_Regs->hc_usbsts = RB_H_STSERR;										/* 清HOST系统错误中断 */
	}			
	else
	{
		EHCI_Regs->hc_usbsts = EHCI_Regs->hc_usbsts;							/* 意外中断 */	
	}				
	return( USB_INT_ERROR );
}

