Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/*******************************************************************************
* Function Name  : USBHOST_Send_qTD
* Description    : USB主机发送一个QTD
* Input          : *Device-------当前操作的设备
                   *spHeadqTD----当前要执行的qTD
*                  *spTempqHD----当前挂载的qHD
*                  *pRetLen------当前qTD执行完毕后返回长度
*                  wTimeOutSec---超时时间(单位为毫秒)
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Send_qTD( ATTACH_DEVICE_INFO *Device, qTD_Structure *spHeadqTD, qHD_Structure *spTempqHD, UINT16 *pRetLen, UINT32 wTimeOutSec )
{
	qTD_Structure *spOldDumyqTD; 
//	qTD_Structure *spReleaseqTD;    
//	UINT32 count;
	UINT32 timeout;
	UINT8  flag;	 
            
	spOldDumyqTD = ( qTD_Structure *)( ( (UINT32)( spTempqHD->bOverlay_NextqTD ) ) << 5 );  // 已有的TD,当前TD
	memcpy( spOldDumyqTD, spHeadqTD, EHCI_QTD_SIZE );  // 复制到当前TD中供操作
        
	spOldDumyqTD->bNextQTDPointer = ( (UINT32)spHeadqTD ) >> 5;  // 将新TD链接上去作为备用,在处理完后从该指针离开
    spOldDumyqTD->bAlternateQTDPointer = ( (UINT32)spHeadqTD ) >> 5;   // 处理完短包后优先从该指针离开
	spOldDumyqTD->bTerminate = 0;   
	spOldDumyqTD->bAlternateTerminate = 0;
	spOldDumyqTD->bStatus_Active = 1;           // 启动对当前TD的操作,新TD不会被操作,当前TD的数据被复制到QH中成为操作副本再处理

	Device->psSendLastqTD = spOldDumyqTD;
	Device->bSendStatusError = 0;
  
	flag = 0x00; 	
	if ( wTimeOutSec > DEF_USB_TIMEOUT / 1000 ) wTimeOutSec = DEF_USB_TIMEOUT / 1000;
	wTimeOutSec = wTimeOutSec * 50 + 5;  // 最少100uS
	for ( timeout = wTimeOutSec; timeout != 0; timeout -- ) { 	/* 等待传输结束 */
//		for ( count = (UINT32)( FREQ_SYS / DELAY_US_CLK_DIV * 20 ); count != 0; count -- );	/* 每间隔20uS左右查询一次 */ 
		Delay_us( 50 );
		if( spOldDumyqTD->bStatus_Active == 0 ) break;	// 完成,操作完成后自动从QH操作副本中复制回来
		if( EHCI_Regs->hc_usbsts & RB_PO_CHG_DET ) {  /* 查询设备是否断开 */
			flag = 0x02;
			EHCI_Regs->hc_usbsts = RB_PO_CHG_DET;
			break;
		}
	}
	gEHCILastStatus = spTempqHD->bOverlay_Status;      	// 保存上次清空累计来的执行状态,这是当前操作副本
//printf("gEHCILastStatus=%08lx\n",gEHCILastStatus);
//	gEHCILastStatus = 0X00;
	if ( spOldDumyqTD->bStatus_Active ) {  // 超时

		USBHOST_Asynchronous_Setting( USBHOST_OP_DISABLE );
		spOldDumyqTD->bStatus_Active = 0;    // 停止        
		spTempqHD->bOverlay_Status = 0x00;  // 停止操作副本
		spOldDumyqTD->bTerminate = 1;   // 断开链表
        spOldDumyqTD->bAlternateTerminate = 1;
		spOldDumyqTD->bErrorCounter = 0x03;                        
        Delay_us( 200 );  // 等待完成
		spOldDumyqTD->bStatus_Active = 0;    // 停止        
		spTempqHD->bOverlay_Status = 0x00;  // 停止操作副本
		flag |= 0x80;
		if( pRetLen ) *pRetLen = *pRetLen - spOldDumyqTD->bTotalBytes;	/* 保存长度 */
//		if( pRetLen ) *pRetLen = *pRetLen - spTempqHD->bOverlay_TotalBytes;	/* 保存长度 */
		spOldDumyqTD = spHeadqTD;  // 超时释放新TD
    }
    else {
    	spTempqHD->bOverlay_Status = 0x00;  // 清空以便再次累计错误
		if( pRetLen ) *pRetLen = *pRetLen - spOldDumyqTD->bTotalBytes;	/* 保存长度 */
    }
	Device->bSendStatusError = gEHCILastStatus;   	/* 暂存当前qHD执行状态,并判断是否有错误发生 */
//    spReleaseqTD = ( qTD_Structure *)( ( (UINT32)( spTempqHD->bOverlay_NextqTD ) ) << 5 );  // 超时停在当前TD,完成则停在下一个TD即备用的新TD
	USBHOST_ReleaseStructure( EHCI_MEM_TYPE_QTD, ( UINT32 )spOldDumyqTD );	/* 回收qTD */
	if ( flag ) USBHOST_Asynchronous_Setting( USBHOST_OP_ENABLE );

	if( ( gEHCILastStatus & EHCI_QTD_STATUS_HALTED ) || ( gEHCILastStatus & EHCI_QTD_STATUS_BUF_ERROR ) || 
		( gEHCILastStatus & EHCI_QTD_STATUS_BABBLE ) || ( gEHCILastStatus & EHCI_QTD_STATUS_TRANS_ERROR ) ||
	    ( gEHCILastStatus & EHCI_QTD_STATUS_MISS_FRAME ) || ( timeout == 0 ) ) 
	{
		flag &= 0x7F;
		flag = timeout ? ( flag == 0x02 ? 0x02 : 0x01 ) : 0x04;  // 0x04=timeout,0x02=disconnect,0x01=error
	}
		
#ifdef  MY_DEBUG_PRINTF 		
	if( gEHCILastStatus & EHCI_QTD_STATUS_HALTED ) 
	{
		printf("ERR: EHCI_QTD_STATUS_HALTED\n");
	}
	if( gEHCILastStatus & EHCI_QTD_STATUS_BUF_ERROR ) 
	{
		printf("ERR: EHCI_QTD_STATUS_BUF_ERROR\n");
	}
	if( gEHCILastStatus & EHCI_QTD_STATUS_BABBLE ) 
	{
		printf("ERR: EHCI_QTD_STATUS_BABBLE\n");
	}
	if( gEHCILastStatus & EHCI_QTD_STATUS_TRANS_ERROR ) 
	{
		printf("ERR: EHCI_QTD_STATUS_TRANS_ERROR\n");
	}
	if( gEHCILastStatus & EHCI_QTD_STATUS_MISS_FRAME ) 
	{  
		printf("ERR: EHCI_QTD_STATUS_MISS_FRAME\n");
	}
	if( timeout == 0 )
	{
		printf("EHCI Time Out.........\n");		
	}
#endif   
#if 0
if ( flag || gEHCILastStatus ) {
	printf("HS=%x.%x\xd\xa", gEHCILastStatus,flag );//??
}
#endif
	/* 返回执行状态 */
	if( flag )  
	{
		if ( flag == 0x04 ) return( ERR_USB_TIMEOUT );
		else if ( flag == 0x02 ) return( USB_INT_DISCONNECT );
		return( USBHOST_Error_Int_Deal( Device ) );		
	}  
	else
	{		 
		return( USB_OPERATE_SUCCESS );
	}
}

/*******************************************************************************
* Function Name  : USBHOST_Issue_Control
* Description    : USB主机发起一个控制传输
* Input          : *Device-----当前操作的设备
*                  *pCmdPack---控制传输命令包
*                  *pDatBuf----收发数据缓冲区
*				   *pRetLen----收发数据实际长度
* Output         : None   
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Issue_Control( ATTACH_DEVICE_INFO *Device, USB_SETUP_REQ *pCmdPack, UINT8 *pDatBuf, UINT16 *pRetLen )
{
	UINT8  status;
	UINT32 total, temp;
	UINT16 retlen;
	UINT8  tog; 
	UINT8  retry;
	UINT8  back[ 8 ];
	UINT8  *pbuf;
	qTD_Structure *spTempqTD;
	
	memcpy( back, pCmdPack, 8 );												/* 备份当前命令包 */	
	for( retry = 0; retry < 3; retry++ )										/* 重试3次 */
	{
		/* 检测设备是否连接 */
		status = USBHOST_EHCI_Detect_Connect( Device );			 		   	    /* 检测设备是否存在 */
		if( ( status == USB_INT_DISCONNECT ) || ( status == 0x00 ) )
		{
		 	return( USB_INT_DISCONNECT );
		}		
		
		/* 1. SETUP阶段 */
		Delay_us( 500 );		
		pbuf = back;

		/* 1.1 分配qTD并初始化 */
		spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD );  
		spTempqTD->bPID = EHCI_QTD_PID_SETUP;                   				/* Bit9---8 */   
		spTempqTD->bTotalBytes = retlen = 8;           							/* Bit30---16 */   
		spTempqTD->bDataToggle = 0;            									/* Bit31 */ 
		spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pbuf; 

		/* 1.2 发送qTD并等待执行完毕  */
		status = USBHOST_Send_qTD( Device, spTempqTD, Device->qHD_Control, &retlen, 1000 );
		Delay_us( 500 );		
		if( status == USB_OPERATE_SUCCESS )
		{	
			/* 2. 数据阶段 */
			/* 由于一次传输最大可以传输20K数据,故没有进行多次循环 */
			tog = TRUE;  											 			/* 默认DATA1,默认无数据故状态阶段为IN */	
			total = ( ( (UINT32)Ctl_Setup->wLengthH ) << 8 ) + Ctl_Setup->wLengthL;
			if( total && pDatBuf )   											/* 需要进行数据收发 */
			{
				pbuf = pDatBuf;
				if( Ctl_Setup->bReqType & 0x80 )   								/* DATA阶段: 数据接收 */
				{	
					/* 2.1 分配IN包相关qTD并初始化 */
					spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD );
					spTempqTD->bPID = EHCI_QTD_PID_IN;		                   	/* Bit9---8 */   
					spTempqTD->bTotalBytes = retlen = total;         			/* Bit30---16 */   
					spTempqTD->bDataToggle = 1;            						/* Bit31 */ 
					spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pbuf;
					temp = ( ( UINT32 )( pbuf ) >> 12  + 1 ) << 12;
					spTempqTD->ArrayBufferPointer_Word[ 1 ] = (UINT32)temp; 
					spTempqTD->ArrayBufferPointer_Word[ 2 ] = (UINT32)temp + 4096;					
					spTempqTD->ArrayBufferPointer_Word[ 3 ] = (UINT32)temp + 2 * 4096;					
					spTempqTD->ArrayBufferPointer_Word[ 4 ] = (UINT32)temp + 3 * 4096;					

					/* 2.2 启动传输并等待执行完毕  */
					status = USBHOST_Send_qTD( Device, spTempqTD, Device->qHD_Control,  &retlen, 1000 );				    
					if( status == USB_INT_DISCONNECT )							/* 如果设备断开,直接返回 */
					{
						return( status );
					}
					if( gEHCILastStatus & EHCI_QTD_STATUS_HALTED )				/* 返回STALL错误 */
					{
						USBHOST_EHCI_ClearEndpStall( Device, 0x00 );			/* 清除端点 */
					}
					tog = FALSE;  												/* 状态阶段为OUT */
				}		   
				else   															/* DATA阶段: 数据发送 */
				{
					/* 2.1 分配OUT包相关qTD并初始化 */
					spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD );  
					spTempqTD->bPID = EHCI_QTD_PID_OUT;	                   		/* Bit9---8 */   
					spTempqTD->bTotalBytes = retlen = total;        			/* Bit30---16 */   
					spTempqTD->bDataToggle = 1;            						/* Bit31 */ 
					spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pbuf;
					temp = ( ( UINT32 )( pbuf ) >> 12  + 1 ) << 12;					
					spTempqTD->ArrayBufferPointer_Word[ 1 ] = (UINT32)temp; 
					spTempqTD->ArrayBufferPointer_Word[ 2 ] = (UINT32)temp + 4096;					
					spTempqTD->ArrayBufferPointer_Word[ 3 ] = (UINT32)temp + 2 * 4096;					
					spTempqTD->ArrayBufferPointer_Word[ 4 ] = (UINT32)temp + 3 * 4096;					

					/* 启动传输并等待执行完毕  */
					status = USBHOST_Send_qTD( Device, spTempqTD, Device->qHD_Control,  &retlen, 1000 );
					if( status == USB_INT_DISCONNECT )							/* 如果设备断开,直接返回 */
					{
						return( status );
					}
					if( gEHCILastStatus & EHCI_QTD_STATUS_HALTED )				/* 返回STALL错误 */
					{
						USBHOST_EHCI_ClearEndpStall( Device, 0x00 );			/* 清除端点 */
					}
					tog = TRUE;  												/* 状态阶段为IN */
				}
				
				/* 保存实际传输长度 */		
				if( pRetLen )  
				{
					*pRetLen = retlen;  										/* 实际成功收发的总长度 */
				}				
			}			
			if( status == USB_OPERATE_SUCCESS )
			{	
				/* 3. 状态阶段 */				
				Delay_us( 500 );		
				/* 3.1 分配IN或OUT包相关qTD并初始化 */
				spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD );
				if( tog == FALSE )	
				{	
					spTempqTD->bPID = EHCI_QTD_PID_OUT;	                  	  	/* Bit9---8 */   
				}
				else
				{
					spTempqTD->bPID = EHCI_QTD_PID_IN;		                    /* Bit9---8 */   					
				}	
				spTempqTD->bDataToggle = 1;            							/* Bit31 */ 
				spTempqTD->bTotalBytes = retlen = 0x00;        					/* Bit30---16 */   
				pbuf = back;
				spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pbuf;

