Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
				/* 3.2 启动传输并等待执行完毕  */
				status = USBHOST_Send_qTD( Device, spTempqTD, Device->qHD_Control,  &retlen, 1000 );
				if( status == USB_OPERATE_SUCCESS )	
				{	
					Delay_us( 200 );		
					return( USB_OPERATE_SUCCESS );			
				}
				else if( status == USB_INT_DISCONNECT )							/* 如果设备断开,直接返回 */
				{
					return( status );
				}				
				else
				{
					/* 缓冲区错、Timeout、CRC、Bad PID等错误则重试 */	
				}	
			}
			else if( status == USB_INT_DISCONNECT )								/* 如果设备断开,直接返回 */
			{
				return( status );				
			}	 
		}	
		Delay_us( 1000 );		
	}
	return( USB_OPERATE_ERROR );	
}

/*******************************************************************************
* Function Name  : USBHOST_Issue_Bulk
* Description    : USB主机执行批量传输
* Input          : *Device-----当前操作的设备
*                  *pBlukqHD---批量端点QH
*                  *pDatBuf---数据缓冲区
*				   *pSize-----发送、接收数据大小
*                  Type-------传输类型(IN/OUT)
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_Issue_Bulk( ATTACH_DEVICE_INFO *Device, qHD_Structure *pBlukqHD, UINT8 *pDatBuf, UINT16 *pSize, UINT8 Type )
{
	qTD_Structure *spTempqTD;
	UINT32 temp;

	/* 为当前批量传输分配1个qTD */	
	spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD ); 
	spTempqTD->bTotalBytes = *pSize;  	
	spTempqTD->bDataToggle = 0;  
	spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pDatBuf;
	temp = ( ( ( UINT32 )( pDatBuf ) >> 12 ) + 1 ) << 12;
	spTempqTD->ArrayBufferPointer_Word[ 1 ] = (UINT32)temp; 
	spTempqTD->ArrayBufferPointer_Word[ 2 ] = (UINT32)temp + 4096;					
	spTempqTD->ArrayBufferPointer_Word[ 3 ] = (UINT32)temp + 2 * 4096;					
	spTempqTD->ArrayBufferPointer_Word[ 4 ] = (UINT32)temp + 3 * 4096;					   
	spTempqTD->bPID = Type;             

	/* 执行传输并等待返回结果 */
	return( USBHOST_Send_qTD( Device, spTempqTD, pBlukqHD, pSize, 200000 ) );	
}

/*******************************************************************************
* Function Name  : USBHOST_Issue_Interrupt
* Description    : USB主机执行中断传输
* Input          : *Device-----当前操作的设备
*                  *pIntqHD---批量端点QH
*                  *pDatBuf---数据缓冲区
*				   *pSize-----发送、接收数据大小
*                  Type-------传输类型(IN/OUT)
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_Issue_Interrupt( ATTACH_DEVICE_INFO *Device, qHD_Structure *pIntqHD, UINT8 *pDatBuf, UINT16 *pSize, UINT8 Type )
{
	qTD_Structure *spTempqTD;
	UINT32 temp;

	/* 为当前中断传输分配1个qTD */	
	spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD ); 
	spTempqTD->bTotalBytes = *pSize;  	
//	spTempqTD->bDataToggle = 0;  
	spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pDatBuf;
	temp = ( ( ( UINT32 )( pDatBuf ) >> 12 ) + 1 ) << 12;
	spTempqTD->ArrayBufferPointer_Word[ 1 ] = (UINT32)temp; 
	spTempqTD->ArrayBufferPointer_Word[ 2 ] = (UINT32)temp + 4096;					
	spTempqTD->ArrayBufferPointer_Word[ 3 ] = (UINT32)temp + 2 * 4096;					
	spTempqTD->ArrayBufferPointer_Word[ 4 ] = (UINT32)temp + 3 * 4096;					   
	spTempqTD->bPID = Type;             

	/* 执行传输并等待返回结果 */
	return( USBHOST_Send_qTD( Device, spTempqTD, pIntqHD, pSize, 1 ) );	
}  

/*******************************************************************************
* Function Name  : USBHOST_Issue_qTD
* Description    : USB主机发起一个QTD
*                  该函数仅仅发起qTD,不等待执行完毕,也不撤销
* Input          : *Device-------当前操作的设备
                   *spHeadqTD----当前要执行的qTD
*                  *spTempqHD----当前挂载的qHD
* Output         : None
* Return         : None
*******************************************************************************/
UINT32 USBHOST_Issue_qTD( ATTACH_DEVICE_INFO *Device, qTD_Structure *spHeadqTD, qHD_Structure *spTempqHD )
{
	qTD_Structure *spOldDumyqTD;   

	spOldDumyqTD = ( qTD_Structure *)( ( (UINT32)( spTempqHD->bOverlay_NextqTD ) ) << 5 );  /* 已有的TD,当前TD */	
	memcpy( spOldDumyqTD, spHeadqTD, EHCI_QTD_SIZE );  							/* 复制到当前TD中供操作 */   
	spOldDumyqTD->bNextQTDPointer = ( (UINT32)spHeadqTD ) >> 5;  				/* 将新TD链接上去作为备用,在处理完后从该指针离开 */
	spOldDumyqTD->bTerminate = 0;   
	spOldDumyqTD->bStatus_Active = 1;           								/* 启动对当前TD的操作,新TD不会被操作,当前TD的数据被复制到QH中成为操作副本再处理 */
    spOldDumyqTD->bAlternateQTDPointer = ( (UINT32)spHeadqTD ) >> 5;   			/* 处理完短包后优先从该指针离开 */
	spOldDumyqTD->bAlternateTerminate = 0;
	Device->psSendLastqTD = spOldDumyqTD;
	Device->bSendStatusError = 0; 
	return( (UINT32)spOldDumyqTD );
}

/*******************************************************************************
* Function Name  : USBHOST_Check_qTD
* Description    : USB主机查询QTD是否执行完毕
* Input          : *Device-------当前操作的设备
*                  *spHeadqTD----当前要查询的qTD
*                  *spTempqHD----当前挂载的qHD
*                  *pRetLen------输入期望获取长度,成功返回实际获取长度
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Check_qTD( ATTACH_DEVICE_INFO *Device, qTD_Structure *spHeadqTD, qHD_Structure *spTempqHD, UINT16 *pRetLen )
{
	qTD_Structure *spOldDumyqTD; 
	qTD_Structure *spReleaseqTD; 

   	spOldDumyqTD = ( qTD_Structure *)spHeadqTD;
	if( spOldDumyqTD->bStatus_Active == 0x00 ) 
	{
		if( pRetLen ) 
		{
			*pRetLen = *pRetLen - spOldDumyqTD->bTotalBytes;					/* 保存长度 */
		} 

		/* 执行成功后的处理 */
		gEHCILastStatus = spTempqHD->bOverlay_Status;      						/* 保存上次清空累计来的执行状态,这是当前操作副本,如果不是超时建议使用spOldDumyqTD的状态 */
		Device->bSendStatusError = gEHCILastStatus;   							/* 暂存当前qHD执行状态,并判断是否有错误发生 */
		spTempqHD->bOverlay_Status = 0;  										/* 清空以便再次累计错误 */
	    spReleaseqTD = ( qTD_Structure *)( ( (UINT32)( spTempqHD->bOverlay_NextqTD ) ) << 5 );  /* 超时停在当前TD,完成则停在下一个TD即备用的新TD */
	    spReleaseqTD = spReleaseqTD == spOldDumyqTD ? spHeadqTD : spOldDumyqTD; /* 超时释放新TD,完成则释放当前TD */
		USBHOST_ReleaseStructure( EHCI_MEM_TYPE_QTD, ( UINT32 )spReleaseqTD );	/* 回收qTD */
		return( USB_OPERATE_SUCCESS );
	}
	return( USB_OPERATE_ERROR );
}

