Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/*******************************************************************************
* Function Name  : USBHOST_Remove_qTD
* Description    : USB主机强制撤销当前QTD
* Input          : *Device-------当前操作的设备
                   *spHeadqTD----当前要查询的qTD
*                  *spTempqHD----当前挂载的qHD
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Remove_qTD( ATTACH_DEVICE_INFO *Device, qTD_Structure *spHeadqTD, qHD_Structure *spTempqHD )
{
	qTD_Structure *spOldDumyqTD; 
	qTD_Structure *spReleaseqTD;   

	spOldDumyqTD = ( qTD_Structure *)( ( (UINT32)( spTempqHD->bOverlay_NextqTD ) ) << 5 );  /* 已有的TD,当前TD */
	USBHOST_Asynchronous_Setting( USBHOST_OP_DISABLE );							/* 停止异步传输 */
	spOldDumyqTD->bStatus_Active = 0;    										/* 停止QTD */        
	spOldDumyqTD->bTerminate = 1;   											/* 断开链表 */
	spOldDumyqTD->bAlternateTerminate = 1;
	spTempqHD->bOverlay_Status &= 0x7F;  										/* 停止操作副本 */
	Delay_us( 100 );  															/* 等待完成 */
	gEHCILastStatus = spTempqHD->bOverlay_Status;      							/* 保存上次清空累计来的执行状态,这是当前操作副本,如果不是超时建议使用spOldDumyqTD的状态 */
	Device->bSendStatusError = gEHCILastStatus;   								/* 暂存当前qHD执行状态,并判断是否有错误发生 */
	spTempqHD->bOverlay_Status = 0;  											/* 清空以便再次累计错误 */
    spReleaseqTD = ( qTD_Structure *)( ( (UINT32)( spTempqHD->bOverlay_NextqTD ) ) << 5 );  /* 超时停在当前TD,完成则停在下一个TD即备用的新TD */
    spReleaseqTD = spReleaseqTD == spOldDumyqTD ? spHeadqTD : spOldDumyqTD;  	/* 超时释放新TD,完成则释放当前TD */
	USBHOST_ReleaseStructure( EHCI_MEM_TYPE_QTD, ( UINT32 )spReleaseqTD );		/* 回收qTD */

	USBHOST_Asynchronous_Setting( USBHOST_OP_ENABLE );
	return( USB_OPERATE_SUCCESS );
}


UINT16 Android_Portocol;

/*******************************************************************************
* Function Name  : Android_Get_Protocol
* Description    : 安卓获取协议命令,01,00--表示为协议1.0,02,00--表示为协议2.0
* Input          : *Device---当前操作的设备
                   *buf------数据缓冲区
                   *len------数据长度                   
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 Android_Get_Protocol(  ATTACH_DEVICE_INFO *Device, UINT8 *buf, UINT16 *len )
{
	UINT16 l;
	UINT8  status;
//0xc0, 0x33, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00	
	/* 填充SETUP命令包 */
	Ctl_Setup->bReqType = 0xc0;
	Ctl_Setup->bRequest = 0x33;
	Ctl_Setup->wValueL  = 0x00;
	Ctl_Setup->wValueH  = 0x00;
	Ctl_Setup->wIndexL  = 0x00;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = *len;
	Ctl_Setup->wLengthH = 0x00;	
	/* 获取协议命令发送 */	
	l = *len;
	status = USBHOST_Issue_Control( Device, Ctl_Setup, buf, &l  );				/* 执行控制传输 */	
	if( status == USB_OPERATE_SUCCESS )
	{	   	

	}
	return( status );
}

/*安卓命令码*/
#define		Manu_Name			0x00		//厂商信息
#define		Model_Name			0x01	    //模式名称
#define		Descr_Name			0x02		//描述
#define		Version				0x03		//版本
#define		URI					0x04		//URI
#define		Serial_Number		0x05	    //串行序列号
/*******************************************************************************
* Function Name  : Android_Set_Information
* Description    : 设置安卓设备信息命令
* Input          : *Device---当前操作的设备
                   *buf------数据缓冲区
                   *len------数据长度   
				   ID--------设置不同设备信息
				   00--------厂商信息“WCH\0”
				   01--------模式名称“CH563 Android Device\0”
				   02--------描述：“CH563 Accessory Device\0”
				   03--------版本：“1.0\0”
				   04--------URI:"http://wch.cn\0"
				   05--------Serial Number:WCH & CH563 & 1.0\0
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 Android_Set_Information(  ATTACH_DEVICE_INFO *Device, UINT8 *buf, UINT16 *len ,UINT8 id)
{
	UINT16 l;
	UINT8  status;
//0xc0, 0x33, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00	
	/* 填充SETUP命令包 */
	Ctl_Setup->bReqType = 0x40;
	Ctl_Setup->bRequest = 0x34;
	Ctl_Setup->wValueL  = 0x00;
	Ctl_Setup->wValueH  = 0x00;
	Ctl_Setup->wIndexL  = id;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = *len;
	Ctl_Setup->wLengthH = 0x00;	
	/* 获取协议命令发送 */	
	l = *len;
	status = USBHOST_Issue_Control( Device, Ctl_Setup, buf, &l  );				/* 执行控制传输 */	
	if( status == USB_OPERATE_SUCCESS )
	{	   	

	}
	return( status );
}



/*******************************************************************************
* Function Name  : Android_Start_AOA
* Description    : 开启AOA命令
* Input          : *Device---当前操作的设备                
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 Android_Start_AOA(  ATTACH_DEVICE_INFO *Device, UINT8 *buf, UINT16 *len)
{
	UINT16 l;
	UINT8  status;
	/* 填充SETUP命令包 */
	Ctl_Setup->bReqType = 0x40;
	Ctl_Setup->bRequest = 0x35;
	Ctl_Setup->wValueL  = 0x00;
	Ctl_Setup->wValueH  = 0x00;
	Ctl_Setup->wIndexL  = 0x00;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = 0x00;
	Ctl_Setup->wLengthH = 0x00;	
	/* 获取协议命令发送 */	
	l = 0;
	status = USBHOST_Issue_Control( Device, Ctl_Setup, buf, &l  );				/* 执行控制传输 */	
	if( status == USB_OPERATE_SUCCESS )
	{	   	

	}
	return( status );
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_GetDeviceDescr
* Description    : USB主机获取设备描述符
* Input          : *Device---当前操作的设备
                   *buf------数据缓冲区
                   *len------数据长度                   
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_EHCI_GetDeviceDescr( ATTACH_DEVICE_INFO *Device, UINT8 *buf, UINT16 *len ) 
{
	UINT16 l;
	UINT8  status;
	
	/* 填充SETUP命令包 */
	Ctl_Setup->bReqType = 0x80;
	Ctl_Setup->bRequest = 0x06;
	Ctl_Setup->wValueL  = 0x00;
	Ctl_Setup->wValueH  = 0x01;
	Ctl_Setup->wIndexL  = 0x00;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = *len;
	Ctl_Setup->wLengthH = 0x00;
	
	/* 先获取设备描述符的前8个字节 */	
	l = *len;
	status = USBHOST_Issue_Control( Device, Ctl_Setup, buf, &l  );				/* 执行控制传输 */	
	if( status == USB_OPERATE_SUCCESS )
	{
		Device->bEp0MaxPks = ( (PUSB_DEV_DESCR)buf ) -> bMaxPacketSize0;  		/* 保存端点0的最大包大小 */
	   	
