Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
		/* 重新分配端点0的最大包大小 */
		Device->qHD_Control->bMaxPacketSize = Device->bEp0MaxPks;      			/* Bit26---16 */ 
		*len = l;																/* 实际获取长度 */	
	}
	return( status );
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_GetConfigDescr
* Description    : USB主机获取配置描述符
* Input          : *Device---当前操作的设备
                   *buf------数据缓冲区
                   *len------数据长度
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_EHCI_GetConfigDescr( ATTACH_DEVICE_INFO *Device, UINT8 *buf, UINT16 *len ) 
{
	UINT16 l;
	UINT8  status;
	
	/* 填充SETUP命令包 */
	Ctl_Setup->bReqType = 0x80;
	Ctl_Setup->bRequest = 0x06;
	Ctl_Setup->wValueL  = 0x00;
	Ctl_Setup->wValueH  = 0x02;
	Ctl_Setup->wIndexL  = 0x00;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = 0x04;
	Ctl_Setup->wLengthH = 0x00;

	/* 先获取配置描述符的前4个字节,以便确定实际总长度 */		
	l = Ctl_Setup->wLengthL;
	status = USBHOST_Issue_Control( Device, Ctl_Setup, buf, &l  );				/* 执行控制传输 */	
	if( status == USB_OPERATE_SUCCESS )
	{
		/* 再以实际总长度获取全部配置描述符 */		
		Ctl_Setup->wLengthL = ( (PUSB_CFG_DESCR)buf ) -> wTotalLengthL;
		Ctl_Setup->wLengthH = ( (PUSB_CFG_DESCR)buf ) -> wTotalLengthH;
		l = ( ( ( UINT16 )Ctl_Setup->wLengthH << 8 ) ) + Ctl_Setup->wLengthL;
		status = USBHOST_Issue_Control( Device, Ctl_Setup, buf, &l  );			/* 执行控制传输 */
		if( status == USB_OPERATE_SUCCESS )
		{
			*len = l;
		}		
		else
		{
			*len = 0x00;
		}	
		return( status );
	}	
	return( status );
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_SetAddress
* Description    : USB主机设置地址
* Input          : *Device---当前操作的设备
                   addr------要设置的地址
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_EHCI_SetAddress( ATTACH_DEVICE_INFO *Device, UINT8 addr ) 
{
	UINT8  status;
			
	/* 填充SETUP命令包 */		
	Ctl_Setup->bReqType = 0x00;
	Ctl_Setup->bRequest = 0x05;
	Ctl_Setup->wValueL  = Device->bDeviceOnHub ? Device->bOnHubPortNumber + addr + 1 : addr;								
	Ctl_Setup->wValueH  = 0x00;
	Ctl_Setup->wIndexL  = 0x00;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = 0x00;
	Ctl_Setup->wLengthH = 0x00;

	/* 设置USB设备地址 */
	status = USBHOST_Issue_Control( Device, Ctl_Setup, NULL, NULL  );			/* 执行控制传输 */		
	if( status == USB_OPERATE_SUCCESS )
	{
		/* 设置自己地址 */	   
		Device->bAddress = Device-> bDeviceOnHub ? Device->bOnHubPortNumber + addr + 1 : addr;	/* 保存当前操作的地址值 */
		Device->qHD_Control->bDeviceAddress = Device->bAddress; 				/* 修改端点操作的地址 */
	}	
	Delay_ms( 5 );  											  				/* 等待USB设备完成操作 */	
	return( status );
}
								   
/*******************************************************************************
* Function Name  : USBHOST_EHCI_SetConfig
* Description    : USB主机设置配置值
* Input          : *Device---当前操作的设备
                   cfg------要设置的配置值
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_EHCI_SetConfig( ATTACH_DEVICE_INFO *Device, UINT8 cfg ) 
{
	UINT8  status;

	/* 填充SETUP命令包 */				
	Ctl_Setup->bReqType = 0x00;
	Ctl_Setup->bRequest = 0x09;
	Ctl_Setup->wValueL  = cfg;
	Ctl_Setup->wValueH  = 0x00;
	Ctl_Setup->wIndexL  = 0x00;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = 0x00;
	Ctl_Setup->wLengthH = 0x00;
	
	/* 设置USB设备配置 */	
	status = USBHOST_Issue_Control( Device, Ctl_Setup, NULL, NULL  );			/* 执行控制传输 */
	return( status );
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_ClearEndpStall
* Description    : USB主机清除端点
* Input          : *Device---当前操作的设备
                   endp------要清除的端点号
* Output         : None
* Return         : 返回当前命令执行状态
*******************************************************************************/
UINT8 USBHOST_EHCI_ClearEndpStall( ATTACH_DEVICE_INFO *Device, UINT8 endp )
{
	UINT8  status;

	/* 填充SETUP命令包 */				
	Ctl_Setup->bReqType = 0x02;
	Ctl_Setup->bRequest = 0x01;
	Ctl_Setup->wValueL  = 0x00;
	Ctl_Setup->wValueH  = 0x00;
	Ctl_Setup->wIndexL  = endp;
	Ctl_Setup->wIndexH  = 0x00;
	Ctl_Setup->wLengthL = 0x00;
	Ctl_Setup->wLengthH = 0x00;
	
	/* 设置USB设备配置 */	
	status = USBHOST_Issue_Control( Device, Ctl_Setup, NULL, NULL  );			/* 执行控制传输 */	
	return( status );
}

/*******************************************************************************
* Function Name  : USBHOST_CofDescrAnalyse
* Description    : USB主机分析配置描述符
*                  此处只是简单判断设备类型,具体需要根据设备类型进行细一步分析
* Input          : *pbuf---描述符缓冲区 
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_CofDescrAnalyse( UINT8 *pbuf )
{
	gDeviceClassType = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceClass;
	if( ( gDeviceClassType <= 0x09 ) || ( gDeviceClassType == 0xFF ) )	
	{
		return( USB_OPERATE_SUCCESS ); 
	}
	else
	{
		gDeviceClassType = USB_DEV_CLASS_RESERVED;								/* 当前设备类型默认未知 */ 	
		return( ERR_USB_UNKNOWN );  									 	    /* 不支持,返回  */
	}			
}

/*******************************************************************************
* Function Name  : USBHOST_EHCI_Enumerate
* Description    : USB主机对设备进行枚举
*                  枚举流程:
                   (1)、以最大包获取设备描述符;
                   (2)、复位USB设备;
                   (3)、设置USB地址;
                   (4)、以实际长度获取设备描述符;
                   (5)、获取4个字节的配置描述符;
                   (6)、以实际长度获取配置描述符;
                   (7)、分析描述符;
                   (8)、设置配置值
* Input          : *Device---当前操作的设备
                   *pbuf-----数据缓冲区
* Output         : None
* Return         : USB_OPERATE_SUCCESS---设备枚举成功;
*                  USB_OPERATE_ERROR-----设备枚举失败;
		
				   00--------厂商信息“WCH\0”
				   01--------模式名称“CH563 Android Device\0”
				   02--------描述：“CH563 Accessory Device\0”
				   03--------版本：“1.0\0”
				   04--------URI:"http://wch.cn\0"
				   05--------Serial Number:WCH & CH563 & 1.0\0
#define		Manu_Name			0x00		//厂商信息
#define		Model_Name			0x01	    //模式名称
#define		Descr_Name			0x02		//描述
#define		Version				0x03		//版本
#define		URI					0x04		//URI
#define		Serial_Number		0x05	    //串行序列号
*******************************************************************************/
UINT8 USBHOST_EHCI_Enumerate( ATTACH_DEVICE_INFO *Device, UINT8 *pbuf )
{
	UINT8  status;
	UINT16 i, len;	
	UINT8 buf[256];
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_Enumerate:..\n" );
#endif
	
	/* (1)、以最大包获取设备描述符 */
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_GetDeviceDescr:...\n" );
#endif
	len = DEFAULT_USB_EP0_SIZE;
	status = USBHOST_EHCI_GetDeviceDescr( Device, pbuf, &len  );  	 			/* 获取设备描述符 */
	if( status != USB_OPERATE_SUCCESS ) 
	{
#ifdef  MY_DEBUG_PRINTF 
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}

#ifdef  MY_DEBUG_PRINTF
	for( i = 0; i < len; i ++ ) 
	{
		printf( "%02X ", (UINT16)*( pbuf + i ) );
	}
	printf( "\n" );
#endif
#if 1
	len = 2;
	status = Android_Get_Protocol( Device,buf,&len );							//如果未非安卓设备类则返回其他错误
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_GetProtocol=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return NONE_ADNROID_DEVICE;				//非安卓设备类
#ifdef  MY_DEBUG_PRINTF 
	printf("buf[0]=%02x\n",buf[0]);
	printf("buf[1]=%02x\n",buf[1]);
#endif
   Android_Portocol	 = 	((UINT16)buf[0]<<8);
   Android_Portocol	 |= (buf[1]);
	
	strcpy( (char *)buf,(const char *)"WCH" );
	len = strlen((const char *) buf )+1;
	status = Android_Set_Information( Device,buf,&len,Manu_Name );
#ifdef  MY_DEBUG_PRINTF 
	printf( "Manu_Name=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return SET_MANU_NAME_ERROR;			

