Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
	strcpy( (char *)buf,(const char *)"WCHUARTDemo" );
	len = strlen((const char *) buf )+1;
	status = Android_Set_Information( Device,buf,&len,Model_Name );
#ifdef  MY_DEBUG_PRINTF 
	printf( "Model_Name=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return SET_MODEL_NAME_ERROR;				


	strcpy( (char *)buf,(const char *)"WCH Accessory Test" );
	len = strlen((const char *) buf )+1;
	status = Android_Set_Information( Device,buf,&len,Descr_Name );
#ifdef  MY_DEBUG_PRINTF 
	printf( "Descr_Name=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return SET_DESCR_NAME_ERROR;				


	strcpy( (char *)buf,(const char *)"1.0" );
	len = strlen((const char *) buf )+1;
	status = Android_Set_Information( Device,buf,&len,Version );
#ifdef  MY_DEBUG_PRINTF 
	printf( "Version=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return SET_VERSION_ERROR;				

	strcpy( (char *)buf,(const char *)"http://wch.cn" );
	len = strlen((const char *) buf )+1;
	status = Android_Set_Information( Device,buf,&len,URI );
#ifdef  MY_DEBUG_PRINTF 
	printf( "URI=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return SET_URI_ERROR;				


	strcpy( (char *)buf,(const char *)"WCHAccessory1" );
	len = strlen((const char *) buf )+1;
	status = Android_Set_Information( Device,buf,&len,Serial_Number );
#ifdef  MY_DEBUG_PRINTF 
	printf( "Serial_Number=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return SET_SERAAL_NUMBER_ERROR;				

	len = 0;
	status = Android_Start_AOA( Device,buf,&len );
#ifdef  MY_DEBUG_PRINTF 
	printf( "Start AOA=%02x\n",status );
#endif
	if( status != USB_OPERATE_SUCCESS)return START_AOA_ERROR;						
	
 #endif

	Delay_ms( 30 );

	/* (2)、复位USB设备*/
	status = USBHOST_EHCI_BusReset( Device );
//printf("aa=%02x\n",status);

	/* 检测等待设备重新连接 */
	for( i = 0; i < 10; i ++ )
	{
		Delay_ms( 100 );
		if( USBHOST_EHCI_Detect_Connect( Device ) == USB_INT_CONNECT )		     /* 检测设备连接 */
		{
			break;
		}
	}
//printf("BB=%02x\n",i);

	len = DEFAULT_USB_EP0_SIZE;
	status = USBHOST_EHCI_GetDeviceDescr( Device, pbuf, &len  );  	 			/* 获取设备描述符 */
	if( status != USB_OPERATE_SUCCESS ) 
	{
#ifdef  MY_DEBUG_PRINTF 
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}

#ifdef  MY_DEBUG_PRINTF
	for( i = 0; i < len; i ++ ) 
	{
		printf( "%02X ", (UINT16)*( pbuf + i ) );
	}
	printf( "\n" );
#endif
	/* (3)、设置USB地址 */
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_SetAddress:...\n " );
#endif
	status = USBHOST_EHCI_SetAddress( Device, DEFAULT_USB_OP_ADDR );  			/* 设置USB设备地址 */
	if( status != USB_OPERATE_SUCCESS )
	{
#ifdef  MY_DEBUG_PRINTF
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}
	Delay_ms( 3 );

	/* (4)、以实际长度获取设备描述符 */
#ifdef  MY_DEBUG_PRINTF 
	printf( "USBHOST_GetDeviceDescr:...\n" );
#endif
	len = 0x12;
	status = USBHOST_EHCI_GetDeviceDescr( Device, pbuf, &len  );  	 			/* 获取设备描述符 */
	if( status != USB_OPERATE_SUCCESS ) 
	{
#ifdef  MY_DEBUG_PRINTF 
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}
#ifdef  MY_DEBUG_PRINTF
	for( i = 0; i < len; i ++ ) 
	{
		printf( "%02X ", (UINT16)*( pbuf + i ) );
	}
	printf( "\n" );
#endif
	Delay_ms( 3 );	
	
	/* (5)、获取4个字节的配置描述符 */
	/* (6)、以实际长度获取配置描述符 */
#ifdef  MY_DEBUG_PRINTF
	printf( "USBHOST_GetConfigDescr:...\n " );
#endif
	status = USBHOST_EHCI_GetConfigDescr( Device, pbuf, &len );  				/* 获取配置描述符 */
	if( status != USB_OPERATE_SUCCESS ) 
	{
#ifdef  MY_DEBUG_PRINTF
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}
#ifdef  MY_DEBUG_PRINTF
	for ( i = 0; i < ( (PUSB_CFG_DESCR)pbuf ) -> wTotalLengthL + ( (UINT16)( (PUSB_CFG_DESCR)pbuf ) -> wTotalLengthH << 8 ); i ++ ) 
	{   
		printf( "%02X ", (UINT16)*( pbuf + i ) );
	}
	printf( "\n" );
#endif
	Delay_ms( 3 );
	
	/* (7)、分析描述符 */	
#ifdef  MY_DEBUG_PRINTF
	printf( "USBHOST_CofDescrAnalyse:...\n " );
#endif	
	status = USBHOST_CofDescrAnalyse( pbuf );									/* 分析配置描述符 */
	if( status != USB_OPERATE_SUCCESS )	
	{	
#ifdef  MY_DEBUG_PRINTF
		printf( "Current Device is Not USB Mass Storage Device\n" );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}
			
	/* (8)、设置配置值 */	
#ifdef  MY_DEBUG_PRINTF
	printf( "USBHOST_SetConfig:...\n " );
#endif
	status = USBHOST_EHCI_SetConfig( Device, ( (PUSB_CFG_DESCR)pbuf ) -> bConfigurationValue ); /* 设置USB设备配置 */
	if ( status != USB_OPERATE_SUCCESS ) 
	{
#ifdef  MY_DEBUG_PRINTF
		printf( "ERROR = %02X\n", (UINT16)status );
#endif
		return( USB_OPERATE_ERROR ); 		 									/* 终止操作,直接返回 */
	}
	Delay_ms( 3 );	
	return( USB_OPERATE_SUCCESS );
}

/*******************************************************************************
* Function Name  : USBHOST_QH_Link_Insert
* Description    : 将当前qHD链接到链表中
* Input          : CurrentQH---当前要链接到链表中去的QH
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_qHD_Link_Insert( qHD_Structure *CurrentqHD )
{
	UINT8  i, flag;
	UINT32 temp;
	qHD_Structure *FirstqHD;
	qHD_Structure *LastqHD;

	FirstqHD = (qHD_Structure*)gEHCI_QHD_BaseAddr;								/* 指向第一个qHD表 */

	/* 通过查询链表结构找到最后一个qHD */	
	flag = 0x00; 	
	LastqHD = (qHD_Structure*)gEHCI_QHD_BaseAddr;	
	for( i = 0; i < EHCI_QHD_MAX; i++ )											
	{
		temp = ( UINT32 )( LastqHD->bNextQHDPointer ) << 5;						/* 链表中当前qHD指向的下一个qHD起始地址 */
		if( ( temp == gEHCI_QHD_BaseAddr ) || ( temp == 0 ) )					
		{	
			flag = 0x01;
			break;
		}
		else
		{
			LastqHD = (qHD_Structure*)temp;
		}				
	}

	if( flag )
	{
		CurrentqHD->bNextQHDPointer = ( ( ( UINT32)FirstqHD ) >> 5 );			/* 将当前qHD链向第一个qHD */		
		LastqHD->bNextQHDPointer = ( ( (UINT32)CurrentqHD ) >> 5 );				/* 将最后一个qHD链向当前qHD */
	}
	else
	{
		return( USB_OPERATE_ERROR );			
	}
	return( USB_OPERATE_SUCCESS );	
}

/*******************************************************************************
* Function Name  : USBHOST_QH_Link_BackOut
* Description    : 将当前QH从链表中摘除
* Input          : CurrentQH---当前要链接到链表中去的QH
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_QH_Link_BackOut( qHD_Structure *CurrentQH )
{
	UINT8  i;
	UINT32 temp;
	UINT32 address;
	qHD_Structure *LastqHD;

	USBHOST_Asynchronous_Setting( USBHOST_OP_DISABLE );							/* 挂起异步传输队列 */
	Delay_ms( 3 );

	/* 通过查询链表结构找到指向该qHD的上一个qHD */		
	LastqHD = (qHD_Structure*)gEHCI_QHD_BaseAddr;	
	address = ( UINT32 )CurrentQH;
	for( i = 0; i < EHCI_QHD_MAX; i++ )											
	{
		temp = ( UINT32 )( LastqHD->bNextQHDPointer ) << 5;						/* 链表中当前qHD指向的下一个qHD起始地址 */
		if( temp == address )					
		{		
			LastqHD->bNextQHDPointer = ( UINT32 )( CurrentQH->bNextQHDPointer );
			break;
		}
		else
		{
			LastqHD = (qHD_Structure*)temp;
		}				
	}
    USBHOST_Asynchronous_Setting( USBHOST_OP_ENABLE );	 						/* 重新使能异步传输队列 */
	Delay_ms( 3 );
	return( USB_OPERATE_SUCCESS );
}
	  
