Edragon/WCH/CH56x/official examples/CH563 AOA操作安卓设备/myfile/EHCI_HCD.C
/*******************************************************************************
* Function Name  : USBHOST_Release_QHD
* Description    : 释放当前QHD(包括从链表摘除、回收QH下挂载的TD、以及回收QH)
* Input          : 
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 USBHOST_Release_QHD( qHD_Structure *CurrentQH )
{
	UINT8  status;

	/* 将当前QH从QH链表中摘除 */
	status = USBHOST_QH_Link_BackOut( CurrentQH );
	if( status )
	{
		return( status );
	}

	/* 回收当前QH下挂载的TD相关内存 */
	status = USBHOST_ReleaseStructure( EHCI_MEM_TYPE_QTD, ( UINT32 )( CurrentQH->bOverlay_NextqTD << 5 ) );
	if( status )
	{
		return( status );
	}

	/* 回收当前QH相关内存 */
	status = USBHOST_ReleaseStructure( EHCI_MEM_TYPE_QHD, ( UINT32 )CurrentQH );
	return( status );
}


/*新加*/
/*******************************************************************************
* Function Name  : MS_Bluk_QH_Allocate
* Description    : 分配批量传输相关QH
* Input          : *Aoainfo----当前操作的U盘相关结构体
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 MS_Bluk_QH_Allocate( AOA_INFO1 *Aoainfo )
{
	UINT32 temp;
//	UINT32 i;
#if 1
	/* 分配批量传输相关QH(qHD_Bulk_Out) */
	if( Aoainfo->BulkOutEp )
	{
		temp = USBHOST_GetStructure( EHCI_MEM_TYPE_QHD );
		if( temp == USB_MEM_ALLOCATE_ERROR )
		{
			return( USB_MEM_ALLOCATE_ERROR );
		}	
		Aoainfo->qHD_Bulk_Out = ( qHD_Structure *)temp;						/* 分配qHD_Structure */
//printf("Aoainfo->qHD_Bulk_Out=%08lx\n",Aoainfo->qHD_Bulk_Out);	
	
		/* 初始化分配的OUT端点 */
		USBHOST_Allocate_QHD( &Aoainfo->Device, 
						      Aoainfo->qHD_Bulk_Out, 
						 	  EHCI_HD_TYPE_QH, 
							  EHCI_EP_TYPE_NO_CONTROL, 
							  0, 
							  Aoainfo->BulkOutEp, 
							  Aoainfo->BulkOutEpSize );
				
		/* 指针关联 */	
		USBHOST_qHD_Link_Insert( Aoainfo->qHD_Bulk_Out );						/* 将qHD_Bulk_Out链接到QH链表中 */
//printf("Aoainfo->qHD_Bulk_Out111=%08lx\n",Aoainfo->qHD_Bulk_Out);	
	}
#endif
#if 1
	/* 分配批量传输相关QH(qHD_Bulk_In) */
	if( Aoainfo->BulkInEp )
	{
		temp = USBHOST_GetStructure( EHCI_MEM_TYPE_QHD );
		if( temp == USB_MEM_ALLOCATE_ERROR )
		{
			return( USB_MEM_ALLOCATE_ERROR );
		}	
		Aoainfo->qHD_Bulk_In = ( qHD_Structure *)temp;							/* 分配qHD_Structure */
//printf("Aoainfo->qHD_Bulk_In=%08lx\n",Aoainfo->qHD_Bulk_In);	
		/* 初始化分配的IN端点 */
		USBHOST_Allocate_QHD( &Aoainfo->Device, 
		                      Aoainfo->qHD_Bulk_In, 
		                      EHCI_HD_TYPE_QH, 
		                      EHCI_EP_TYPE_NO_CONTROL, 
		                      0, 
		                      Aoainfo->BulkInEp, 
		                      Aoainfo->BulkInEpSize );	
	
		/* 指针关联 */	
		USBHOST_qHD_Link_Insert( Aoainfo->qHD_Bulk_In );						/* 将qHD_Bulk_In链接到QH链表中 */
//printf("Aoainfo->qHD_Bulk_In11111=%08lx\n",Aoainfo->qHD_Bulk_In);	
	}
#endif




	return( USB_OPERATE_SUCCESS );	
}

/*******************************************************************************
* Function Name  : MS_CofDescrAnalyse
* Description    : 分析Mass Storage Device配置描述符
* Input          : *Aoainfo----当前操作的U盘相关结构体
*                  *pbuf--------当前需要分析的配置描述符缓冲区
* Output         : None
* Return         : USB_OPERATE_SUCCESS----Mass Storage Device; 
*                  USB_OPERATE_ERROR---其它设备
*******************************************************************************/
UINT8 MS_CofDescrAnalyse( AOA_INFO1 *Aoainfo, UINT8 *pbuf )
{
	UINT16 i;
	UINT8  status;
	
	/* 分析配置描述符,获取端点数据(各端点地址/各端点大小等) */
//	if ( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceClass != 0x08 ) 
//	{
//		return( USB_OPERATE_ERROR );  									 	    /* 不是USB存储类设备,直接返回  */
//	}	
	Aoainfo->InterfNumber = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceNumber;  /* 保存接口号 */
	Aoainfo->BulkInEp  = 0;
	Aoainfo->BulkOutEp = 0;
	for( i = 0; i < 2; i ++ )   												/* 只分析前两个端点 */
	{
		if( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bLength == 0x07
			&& ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bDescriptorType == 0x05  
			&& ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bmAttributes == 2 ) 
		{  	
			if( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x80 )
			{	
				/* 批量IN端点 */
				Aoainfo->BulkInEp = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x0F;   /* IN端点 */
				Aoainfo->BulkInEpSize = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeH;
				Aoainfo->BulkInEpSize = Aoainfo->BulkInEpSize << 8;
				Aoainfo->BulkInEpSize += ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeL;				
			}
			else 
			{
				Aoainfo->BulkOutEp = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].bEndpointAddress & 0x0F;  /* OUT端点 */
				Aoainfo->BulkOutEpSize = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeH;
				Aoainfo->BulkOutEpSize = Aoainfo->BulkOutEpSize << 8;
				Aoainfo->BulkOutEpSize += ( (PUSB_CFG_DESCR_LONG)pbuf ) -> endp_descr[ i ].wMaxPacketSizeL;				
			}
		}
	}
//	if( ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceClass != 0x08 || Aoainfo->BulkInEp == 0 || Aoainfo->BulkOutEp == 0 )
//	{  															 				/* 不是USB存储类设备,不支持 */
//		return( USB_OPERATE_ERROR ); 	  									    /* 终止操作,直接返回 */
//	}
//	Aoainfo->BulkInEp = 0X01;

#ifdef  MY_DEBUG_PRINTF 
	printf("Aoainfo->BulkInEp:%02x\n ",Aoainfo->BulkInEp);
	printf("Aoainfo->BulkOutEp:%02x\n ",Aoainfo->BulkOutEp);
	printf("Aoainfo->BulkInEpSize:%02x\n ",Aoainfo->BulkInEpSize);
	printf("Aoainfo->BulkOutEpSize:%02x\n ",Aoainfo->BulkOutEpSize);
#endif
	/*******************************分配大容量存储设备相关内存************************/
	status = MS_Bluk_QH_Allocate( Aoainfo );									/* USB主机批量传输相关QH、TD分配 */
	if ( status != USB_OPERATE_SUCCESS ) 
	{
		return( status ); 	  									    			/* 终止操作,直接返回 */	
	}	
	return( USB_OPERATE_SUCCESS );
}

/*发送数据*/
UINT8 AOA_OUT_Data( AOA_INFO1 *Aoainfo,UINT8 *pbuf,UINT16 len ){
	UINT8 status;
	status = USBHOST_Issue_Bulk( &Aoainfo->Device, Aoainfo->qHD_Bulk_Out, pbuf, &len, EHCI_QTD_PID_OUT );
	return status;
}


/*发送数据*/
UINT8 AOA_IN_Data( AOA_INFO1 *Aoainfo,UINT8 *pbuf,UINT16 len )
{
	UINT8 status;
	UINT32 temp;
	qTD_Structure *spTempqTD;
	/* 为当前批量传输分配1个qTD */	
	spTempqTD = ( qTD_Structure *)USBHOST_GetStructure( EHCI_MEM_TYPE_QTD ); 
	spTempqTD->bTotalBytes = len;  	
	spTempqTD->ArrayBufferPointer_Word[ 0 ] = (UINT32)pbuf;
	temp = ( ( ( UINT32 )( pbuf ) >> 12 ) + 1 ) << 12;
	spTempqTD->ArrayBufferPointer_Word[ 1 ] = (UINT32)temp; 
	spTempqTD->ArrayBufferPointer_Word[ 2 ] = (UINT32)temp + 4096;					
	spTempqTD->ArrayBufferPointer_Word[ 3 ] = (UINT32)temp + 2 * 4096;					
	spTempqTD->ArrayBufferPointer_Word[ 4 ] = (UINT32)temp + 3 * 4096;					   
	spTempqTD->bPID = EHCI_QTD_PID_IN; 

	/* USB主机发起一个QTD */
	status = USBHOST_Issue_qTD( &Aoainfo->Device, spTempqTD, Aoainfo->qHD_Bulk_In );
	temp = 0;
	while(1)
	{
		status = USBHOST_Check_qTD( &Aoainfo->Device,spTempqTD, Aoainfo->qHD_Bulk_In, &len );
		if( status == USB_OPERATE_SUCCESS )
		{
			break;
		}
		temp++;
		Delay_ms( 1 );
		if( temp>=500 ){						//500ms的超时
			status = ERR_USB_TIMEOUT;
			break;
		}
	}

	USBHOST_Remove_qTD( &Aoainfo->Device, spTempqTD, Aoainfo->qHD_Bulk_In );
	return status;
}





